<?php

use App\Permission;
use Illuminate\Database\Seeder;

class PermissionsTableSeeder extends Seeder
{
    public function run()
    {
        $permissions = [
            [
                'id'    => '1',
                'title' => 'دسترسی مدیریت کاربر',
            ],
            [
                'id'    => '2',
                'title' => 'ایجاد دسترسی',
            ],
            [
                'id'    => '3',
                'title' => 'ویرایش دسترسی',
            ],
            [
                'id'    => '4',
                'title' => 'نمایش دسترسی',
            ],
            [
                'id'    => '5',
                'title' => 'حذف دسترسی',
            ],
            [
                'id'    => '6',
                'title' => 'مدیریت دسترسی',
            ],
            [
                'id'    => '7',
                'title' => 'ایجاد نقش',
            ],
            [
                'id'    => '8',
                'title' => 'ویرایش نقش',
            ],
            [
                'id'    => '9',
                'title' => 'نمایش نقش',
            ],
            [
                'id'    => '10',
                'title' => 'حذف نقش',
            ],
            [
                'id'    => '11',
                'title' => 'مدیریت نقش',
            ],
            [
                'id'    => '12',
                'title' => 'ایجاد کاربر'
            ],
            [
                'id'    => '13',
                'title' => 'ویرایش کاربر',
            ],
            [
                'id'    => '14',
                'title' => 'نمایش کاربر',
            ],
            [
                'id'    => '15',
                'title' => 'حذف کاربر',
            ],
            [
                'id'    => '16',
                'title' => 'دسترسی کاربر',
            ],
            [
                'id'    => '17',
                'title' => 'ایجاد درس',
            ],
            [
                'id'    => '18',
                'title' => 'ویرایش درس',
            ],
            [
                'id'    => '19',
                'title' => 'نمایش درس',
            ],
            [
                'id'    => '20',
                'title' => 'حذف درس',
            ],
            [
                'id'    => '21',
                'title' => 'دسترسی دروس',
            ],
            [
                'id'    => '22',
                'title' => 'ایجاد کلاس',
            ],
            [
                'id'    => '23',
                'title' => 'ویرایش کلاس',
            ],
            [
                'id'    => '24',
                'title' => 'نمایش اطلاعات کلاس',
            ],
            [
                'id'    => '25',
                'title' => 'حذف کلاس',
            ],
            [
                'id'    => '26',
                'title' => 'دسترسی به کلاس ها',
            ],
        ];

        Permission::insert($permissions);
    }
}
